GT3/RANS-kOmegaSSTLM/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volTensorField;
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
66675
(
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 -4.3060826e-11 0 0 0 0 0)
...
)
;

boundaryField
{
    lowerWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
600
(
(0 0 0 530967 0 0 0 0 0)
(0 0 0 530967 0 0 0 0 0)
(0 0 0 530967 0 0 0 0 0)
(0 0 0 530967 0 0 0 0 0)
(0 0 0 530967 0 0 0 0 0)
(0 0 0 530967 0 0 0 0 0)
(0 0 0 530967 0 0 0 0 0)
(0 0 0 530967 0 0 0 0 0)
...
)
;
    }
    lowerSymmetry
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    upperSymmetry
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    inlet
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
105
(
(0 0 0 265483.5 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
